/*
Выведите свои имя и возраст
*/

#include <iostream>

using std::cout;

int main()
{
	setlocale(LC_ALL, "rus");

	cout << "Александр\n";
	cout << 29 << "\n";

	return 0;
}